lib/tasks/dev.rake

  task import_coins: :environment do
    if Rails.env.development?
      active_spinner("Importing Coins...") do
        coins = [
          {
            description: "Bitcoin",
            acronym: "BTC",
            url_image: "https://png.pngtree.com/png-clipart/20211212/original/pngtree-bitcoin-png-png-image_6961160.png",
            mining_type: MiningType.find_by(acronym: "POW")
          },
          {
            description: "Etherium",
            acronym: "ETH",
            url_image: "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR5JfenCFa1c9KP4-LQZ1TzP-tMMPiXYG1NyQ&s",
            mining_type: MiningType.all.sample
          },
          {
            description: "Dash",
            acronym: "DASH",
            url_image: "https://gallery.yopriceville.com/downloadfullsize/send/21848",
            mining_type: MiningType.all.sample
          }
        ]

        coins.each do |coin|
          Coin.find_or_create_by!(coin)
---
SELECT [mining_types].* FROM [mining_types] WHERE [mining_types].[acronym] = N'POW' ORDER BY [mining_types].[id] ASC OFFSET 0 ROWS FETCH NEXT 11 ROWS ONLY
SELECT [coins].* FROM [coins] WHERE [coins].[description] = N'Bitcoin' AND [coins].[acronym] = N'BTC' AND [coins].[url_image] = N'https://png.pngtree.com/png-clipart/20211212/original/pngtree-bitcoin-png-png-image_6961160.png' ORDER BY [coins].[id] ASC OFFSET 0 ROWS FETCH NEXT 1 ROWS ONLY
SELECT [mining_types].* FROM [mining_types] WHERE [mining_types].[acronym] = N'POW' ORDER BY [mining_types].[id] ASC OFFSET 0 ROWS FETCH NEXT 1 ROWS ONLY
SELECT [mining_types].* FROM [mining_types]
INSERT INTO [coins] ([description], [acronym], [url_image], [created_at], [updated_at], [mining_type_id]) OUTPUT INSERTED.[id] VALUES (N'Bitcoin', N'BTC', N'https://png.pngtree.com/png-clipart/20211212/original/pngtree-bitcoin-png-png-image_6961160.png', '06-30-2025 22:37:14.77074', '06-30-2025 22:37:14.77074', 1)

  task import_mining_type: :environment do
    if Rails.env.development?
      active_spinner("Importing Mining Types...") do

        mining_types = [
          {
            description: "Pool of Mining",
            acronym: "POW",
          },
          {
            description: "Proof of Stake",
            acronym: "POS"
          }
        ]
        mining_types.each do |mining_type|
          MiningType.find_or_create_by!(mining_type)
---
INSERT INTO [mining_types] ([description], [acronym], [created_at], [updated_at]) OUTPUT INSERTED.[id] VALUES (N'Pool of Mining', N'POW', '06-30-2025 22:34:52.716421', '06-30-2025 22:34:52.716421')