app/controllers/coins_controller.rb

  def index
    @coins = Coin.all
---
SELECT [coins].* FROM [coins]

  def create
    @coin = Coin.new(coin_params)

    respond_to do |format|
      if @coin.save
---
INSERT INTO [coins] ([description], [acronym], [url_image], [created_at], [updated_at]) OUTPUT INSERTED.[id] VALUES (N'testcoin', N'dasdad', N'image', '05-17-2025 23:34:33.61957', '05-17-2025 23:34:33.61957')

  def update
    respond_to do |format|
      if @coin.update(coin_params)
---
UPDATE [coins] SET [updated_at] = '08-28-2025 23:09:56.385198', [mining_type_id] = 2 WHERE [coins].[id] = 1; SELECT @@ROWCOUNT AS AffectedRows

  def destroy
    @coin.destroy!
---
DELETE FROM [coins] WHERE [coins].[id] = 1; SELECT @@ROWCOUNT AS AffectedRows

    def set_coin
      @coin = Coin.find(params.expect(:id))
---
SELECT [coins].* FROM [coins] WHERE [coins].[id] = 1 ORDER BY [coins].[id] ASC OFFSET 0 ROWS FETCH NEXT 1 ROWS ONLY

    def set_mining_type_options
      @mining_type_options = MiningType.all.pluck(:description, :id)
---
SELECT [mining_types].[description], [mining_types].[id] FROM [mining_types]