app/controllers/mining_types_controller.rb

SELECT [mining_types].* FROM [mining_types]
---
  def index
    @mining_types = MiningType.all

INSERT INTO [mining_types] ([name], [acronym], [created_at], [updated_at]) OUTPUT INSERTED.[id] VALUES (N'Test', N'TST', '06-10-2025 23:10:45.282957', '06-10-2025 23:10:45.282957')
---
  def create
    @mining_type = MiningType.new(mining_type_params)

    respond_to do |format|
      if @mining_type.save

DELETE FROM [mining_types] WHERE [mining_types].[id] = 1; SELECT @@ROWCOUNT AS AffectedRows
---
  def destroy
    @mining_type.destroy!

SELECT [mining_types].* FROM [mining_types] WHERE [mining_types].[id] = 1 ORDER BY [mining_types].[id] ASC OFFSET 0 ROWS FETCH NEXT 1 ROWS ONLY
---
    def set_mining_type
      @mining_type = MiningType.find(params.expect(:id))