app/views/coins/_form.html.erb

SELECT [mining_types].[description], [mining_types].[id] FROM [mining_types]
---
    <%= form.label :mining_type_id, style: "display: block" %>
    <%= form.select("mining_type_id", MiningType.all.map { |m| [m.description, m.id] }, {include_blank: 'select...'} ) %>